{"index":{"hero-text":"Welcome to our most central backpacker hostel in Edinburgh, where cleanliness and customer service are our top priorities! We understand the importance of good value for money when traveling, that's why we offer affordable and comfortable accommodation to our guests. Our friendly and dedicated staff are available to make sure you have a great stay. Whether you're exploring the city and beyond or just need a place to rest your head, we have you covered. Book your stay with us today and experience the best value for money in central Edinburgh!","card-1-text":"We offer a variety of room options to suit your needs including private double and quadruple rooms, small and large dorms. Guests can enjoy our communal facilities such as a fully equipped kitchen and lounge area. Perfect for cooking your own meals, socializing and relax after a long day of sightseeing.","card-2-text":"We specialize in accommodating groups with preferential rates for unforgettable stays in the Scottish capital. Whether you are a group of friends, a sports team or a school group, we are here to make your stay in Edinburgh affordable, comfortable and memorable.","card-3-text":"You can book the best tours in Edinburgh and around Scotland directly through our partner tour portal. From historical landmarks to scenic countryside, tours will take you to the must-see destinations in Scotland. We have partnered with the best local tour operators to offer you a variety of tours to suit your interests and budget. Book your tour with us today and discover the beauty of Scotland with ease."},"rooms":{"title":"Discover our Rooms","general-description":"Our hostel is divided into 4 levels. Our shared bathroom facilities are cleaned and maintained regularly to ensure they are always spotless.","db-rooms-description":"Our hostel offers clean and cosy double rooms with shared bathrooms. Perfect for travellers on a budget, each room is equipped with comfortable beds and basic amenities. Guests have access to shared bathrooms and shower facilities. Our rooms are perfect for couples, friends or solo travellers who want to save money while still having a comfortable place to stay.","shared-rooms-description":"Our dormitory rooms are perfect for groups, friends and individual travellers on a budget. We offer 4-beds to 10-beds room options, all with shared bathroom facilities. Each bed is equipped with USB plugs and a locker to keep your personal belongings safe. Some of our dorms are female only so that everyone can feel comfortable. If you fancy making friends and enjoy the essence of what a hostel is you will love the budget friendly dorms!","private-rooms-description":"Our quadruple and larger private rooms are perfect for groups, friends and families looking for a private comfortable and affordable accommodation in the heart of Edinburgh. Each room features multiple comfortable beds and shared bathroom facilities, providing everything you need for a pleasant stay. Each bed is equipped with USB plugs for your convenience."}}